Revit 2027 API
ExtendedPropertiesLinkValues.AddValue(ForgeTypeId, String) Method
 Add a string value for a given schema id.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddValue(
	ForgeTypeId schemaId,
	string value
)
Public Function AddValue (
	schemaId As ForgeTypeId,
	value As String
) As Boolean
public:
bool AddValue(
	ForgeTypeId^ schemaId,
	String^ value
)
member AddValue :
        schemaId : ForgeTypeId *
        value : string -> bool
Parameters
schemaId ForgeTypeId
 Identifier of the schema.
value String
 The string value.
Return Value
Boolean
 True if the data was added, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkValues Class
AddValue Overload
Autodesk.Revit.DB.ExternalData Namespace